
#!/bin/bash

Version="0.2"

case "$1" in
 "-S" | "-s" | "--Setup"  | "--setup"  )       mv ./ansc.sh /usr/local/bin;
                                               echo "Установлено";
                                               exit;;

 "-V" | "-v" | "-Version" | "-version" )       echo "Version = $Version";
                                               exit;;
esac

clear

echo "AnanacScript v0.2"
echo ""
echo ""
echo ""
echo -e "\e[31m         ▄▄▄       ███▄    █  ▄▄▄       ███▄    █  ▄▄▄       ▄████▄    ██████  ▄████▄   ██▀███   ██▓ ██▓███  ▄▄▄█████▓  \e[0m"
echo -e "\e[31m        ▒████▄     ██ ▀█   █ ▒████▄     ██ ▀█   █ ▒████▄    ▒██▀ ▀█  ▒██    ▒ ▒██▀ ▀█  ▓██ ▒ ██▒▓██▒▓██░  ██▒▓  ██▒ ▓▒  \e[0m"
echo -e "\e[31m        ▒██  ▀█▄  ▓██  ▀█ ██▒▒██  ▀█▄  ▓██  ▀█ ██▒▒██  ▀█▄  ▒▓█    ▄ ░ ▓██▄   ▒▓█    ▄ ▓██ ░▄█ ▒▒██▒▓██░ ██▓▒▒ ▓██░ ▒░  \e[0m"
echo -e "\e[31m        ░██▄▄▄▄██ ▓██▒  ▐▌██▒░██▄▄▄▄██ ▓██▒  ▐▌██▒░██▄▄▄▄██ ▒▓▓▄ ▄██▒  ▒   ██▒▒▓▓▄ ▄██▒▒██▀▀█▄  ░██░▒██▄█▓▒ ▒░ ▓██▓ ░   \e[0m"
echo -e "\e[31m         ▓█   ▓██▒▒██░   ▓██░ ▓█   ▓██▒▒██░   ▓██░ ▓█   ▓██▒▒ ▓███▀ ░▒██████▒▒▒ ▓███▀ ░░██▓ ▒██▒░██░▒██▒ ░  ░  ▒██▒ ░   \e[0m"
echo -e "\e[31m         ▒▒   ▓▒█░░ ▒░   ▒ ▒  ▒▒   ▓▒█░░ ▒░   ▒ ▒  ▒▒   ▓▒█░░ ░▒ ▒  ░▒ ▒▓▒ ▒ ░░ ░▒ ▒  ░░ ▒▓ ░▒▓░░▓  ▒▓▒░ ░  ░  ▒ ░░     \e[0m"
echo -e "\e[31m          ▒   ▒▒ ░░ ░░   ░ ▒░  ▒   ▒▒ ░░ ░░   ░ ▒░  ▒   ▒▒ ░  ░  ▒   ░ ░▒  ░ ░  ░  ▒     ░▒ ░ ▒░ ▒ ░░▒ ░         ░      \e[0m"
echo -e "\e[31m          ░   ▒      ░   ░ ░   ░   ▒      ░   ░ ░   ░   ▒   ░        ░  ░  ░  ░          ░░   ░  ▒ ░░░         ░        \e[0m"
echo -e "\e[31m              ░  ░         ░       ░  ░         ░       ░  ░░ ░            ░  ░ ░         ░      ░                      \e[0m"
echo ""
echo ""
echo ""
echo -e "\e[32m[1] *Перевести адаптер в режим мониторинга\e[0m"
echo -e "\e[32m[2] Перезапустить NetworkManager\e[0m"
echo -e "\e[32m[3] *Сменить MAC-адрес\e[0m"
echo -e "\e[32m[4] *Создать фейковую ТД\e[0m"
echo -e "\e[32m[5] *[]\e[0m"
echo -e "\e[32m[6] *[]\e[0m"
echo -e "\e[32m[7] *[]\e[0m"
echo -e "\e[32m[8] *[]\e[0m"
echo -e "\e[32m[9] *[]\e[0m"

echo ""
echo -e "\e[41mВведите номер команды: \e[0m"

read Event

case "$Event" in
 "1" ) ;;
 "2" ) service network-manager restart;;
 "3" ) ;;
 "4" ) ;;
 "5" ) ;;
 "6" ) ;;
 "7" ) ;;
 "8" ) ;;
 "9" ) ;;
esac
